<?php
$profile = array('主人公' => array('職業' => '勇者',
                                '得意技' => 'ギガデイン',
                                '性別' => '男',
                                '装備' => 'ロト装備'),
                'カミュ' => array('職業' => '盗賊',
                                '得意技' => 'ぬすむ',
                                '性別' => '男',
                                '装備' => '海賊装備'),
                'ベロニカ' => array('職業' => '魔法使い',
                                '得意技' => 'イオグランデ',
                                '性別' => '女',
                                '装備' => 'とこしえ装備'),
                'マルティナ' => array('職業' => '武闘家',
                                '得意技' => 'ばくれつきゃく',
                                '性別' => '女',
                                '装備' => '神竜装備'));

foreach ($profile as $person => $data) {
  echo $person . "<br>";
  foreach ($data as $param => $detail) {
    echo $param . ": " . $detail . "<br>";
  }
}
?>